"""
example07 - 排序

冒泡排序：元素两两比较，如果前面的元素大于后面的元素，就交换两个元素的位置
[35, 12, 99, 58, 67, 42, 49, 31, 73]
[12, 35, 99, 58, 67, 42, 49, 31, 73]
[12, 35, 99, 58, 67, 42, 49, 31, 73]
[12, 35, 58, 99, 67, 42, 49, 31, 73]
[12, 35, 58, 67, 99, 42, 49, 31, 73]
[12, 35, 58, 67, 42, 99, 49, 31, 73]
[12, 35, 58, 67, 42, 49, 99, 31, 73]
[12, 35, 58, 67, 42, 49, 31, 99, 73]
[12, 35, 58, 67, 42, 49, 31, 73, 99]

[12, 35, 58, 67, 42, 49, 31, 73]
[12, 35, 58, 67, 42, 49, 31, 73]
[12, 35, 58, 42, 67, 49, 31, 73]
[12, 35, 58, 42, 49, 67, 31, 73]
[12, 35, 58, 42, 49, 31, 67, 73]

搅拌排序（鸡尾酒排序）

Author: jiuri
Date: 2022/1/10
"""

nums = [9, 1, 2, 3, 4, 5, 6, 7, 8]
# nums = [35, 12, 99, 58, 67, 42, 49, 31, 73]

# 整个做n - 1次，就可以把n - 1 个大数沉下去，最后一个就是最小的
for i in range(1, len(nums)):
    swapped = False
    # 做过的就不用再做了，已经是最大的了
    for j in range(0, len(nums) - i):
        if nums[j] > nums[j + 1]:
            nums[j], nums[j + 1] = nums[j + 1], nums[j]
            swapped = True
    # 如果一次都没交换，就终止循环
    if not swapped:
        break
print(nums)
